УТ_для_edt.РасширениеСмарт/src/Documents/ПоступлениеБезналичныхДенежныхСредств/ПоступлениеБезналичныхДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПоступлениеБезналичныхДенежныхСредств</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВалютаКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроведеноБанком</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИдентификаторПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодтверждениеЗачисленияЗарплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>БанковскийСчетОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипПлатежногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПроведенияБанком</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассаОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяАктивовПассивов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КурсКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СуммаКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смарт_ОплаченоЧерезКассуБанка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДанныеВыписки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e745a4f7-e3f0-43f6-9a5f-7aef0bc51a0b">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Заказ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Организация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДоговорКредитаДепозита</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ОснованиеПлатежа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДоговорЗаймаСотруднику</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ТипСуммыКредитаДепозита</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВалютаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяДоходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаДоходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9c833630-69a2-4041-a061-4deff13f755d">
      <name>смартКурсДокумента</name>
      <comment>#1320 смарт: Лопато 01.03.2023 //Изменить порядок вычисленя Курса и Суммы взаиморасчета в валюте</comment>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СостоянияЗаказовКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes>
    <name>СуммаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДолга</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроцентОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПроцентОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПроцентДолга</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЕстьРасхожденияОрдерНакладная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/СостоянияЗаказовПоставщикам/СостоянияЗаказовПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СостоянияЗаказовПоставщикам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes>
    <name>ПроцентДолга</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДолга</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроцентПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПроцентОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СуммаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3ad5d8a7-3071-46aa-aebf-306bdb67983b">
  <name>ДополнительныеСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ab7ef662-71c1-4d51-9f0f-ea8c5ea3df8a">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb954476-c551-4a06-9bcd-18d67ba47dc8">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79201015-bfae-463e-81f1-0ae2d3066f3f">
    <name>Свойство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Enums/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СостоянияЗаказовКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/ТипыПлатежныхДокументов/ТипыПлатежныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыПлатежныхДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПлатежноеПоручение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИнкассовоеПоручение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПлатежноеТребование</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПлатежныйОрдер</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0d669534-eb6b-4fcd-8170-2cb42a136850">
    <name>БанковскийОрдер</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9aa96fc1-9c88-4c80-a8f5-09bbbbb0d5b5">
    <name>РаспоряжениеОбОбязательнойПродаже</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Documents/ПоступлениеБезналичныхДенежныхСредств/ObjectModule.bsl
#Область ПеренесеноСДоработками

#КонецОбласти    

#Область ДоработкиСмарт

// Смарт Фролов+ Проверка есть ли в табличной части "Расшифровка платежа" ОснованиеПлатежа со статусом "Закрыт"
// Возвращает данные - Стукрура 
Функция смартЕстьЗакрытыеЗаказы()
	ДанныеПоЗаказам=Новый Структура("ЕстьЗакрытые,СписокЗакрытыхЗаказов",Ложь,"");
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Таб",ЭтотОбъект.РасшифровкаПлатежа.Выгрузить(,"ОснованиеПлатежа"));
	Запрос.Текст="ВЫБРАТЬ
	             |	ВЫРАЗИТЬ(Т.ОснованиеПлатежа КАК Документ.ЗаказКлиента) КАК ЗаказКлиента
	             |ПОМЕСТИТЬ ВТ
	             |ИЗ
	             |	&Таб КАК Т
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВТ.ЗаказКлиента КАК ЗаказКлиента
	             |ИЗ
	             |	ВТ КАК ВТ
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	             |		ПО ВТ.ЗаказКлиента = СостоянияЗаказовКлиентов.Заказ
	             |ГДЕ
	             |	СостоянияЗаказовКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.Закрыт)";
	Рез=Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() Тогда 
		ДанныеПоЗаказам.ЕстьЗакрытые=Истина;
		ДанныеПоЗаказам.СписокЗакрытыхЗаказов=СтрСоединить(Рез.ВыгрузитьКолонку("ЗаказКлиента"),";"+Символы.ПС);
	КонецЕсли;	
	
	Возврат ДанныеПоЗаказам;
КонецФункции	

//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
&ИзменениеИКонтроль("ПередЗаписью")
Процедура смарт_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	#Вставка
	//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств 
	// Смарт Фролов+ Выполнить проверку по "Закрытым" заказам
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения 
		И ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента 
		И Не РольДоступна("ПолныеПрава") Тогда 
		
		ДанныеПоЗаказам = смартЕстьЗакрытыеЗаказы();
		
		Если ДанныеПоЗаказам.ЕстьЗакрытые Тогда  
			
			Текст = "Документ не может быть распроведен (помечен на удаление).
				|По нему есть 'Закрытые' заказы:
				|" + ДанныеПоЗаказам.СписокЗакрытыхЗаказов; 
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , , , Отказ); 
			
		КонецЕсли;  
		
	КонецЕсли;	
	// Фролов-
	//-- #Б-960 смарт: Мосолов 23.09.2024 
	#КонецВставки
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);

	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

	СформироватьСписокЗависимыхЗаказов();

	// Очистим табличную часть, если она не должна заполняться.
	МассивРеквизитовОперации = Новый Массив;
	Документы.ПоступлениеБезналичныхДенежныхСредств.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(ХозяйственнаяОперация, Неопределено, МассивРеквизитовОперации);

	Если РасшифровкаПлатежа.Количество() > 0
		И (МассивРеквизитовОперации.Найти("РасшифровкаПлатежа") = Неопределено
		Или Документы.ПоступлениеБезналичныхДенежныхСредств.МассивОперацийБезРасшифровкиПлатежа().Найти(ХозяйственнаяОперация) <> Неопределено
		) Тогда
		РасшифровкаПлатежа.Очистить();
	КонецЕсли;

	СсылкаНаПлатеж = Ссылка;
	// Заполнение суммы взаиморасчетов в табличной части "Расшифровка платежа".
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если (ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента
			ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика
			ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации
			ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтДругойОрганизации
			ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствПоКредитам
			ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствПоДепозитам
			ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствПоЗаймамВыданным
			) Тогда
			ВзаиморасчетыСервер.ЗаполнитьСуммуВзаиморасчетовВТабличнойЧасти(
			Валюта,
			?(ПроведеноБанком, ДатаПроведенияБанком, Дата),
			РасшифровкаПлатежа);

			Если ЭтоНовый() Тогда
				СсылкаНаПлатеж = Документы.ПоступлениеБезналичныхДенежныхСредств.ПолучитьСсылку();
				УстановитьСсылкуНового(СсылкаНаПлатеж);
			КонецЕсли;

			Для Каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
				Если Не ЗначениеЗаполнено(СтрокаРасшифровки.Заказ) Тогда
					СтрокаРасшифровки.Заказ = СсылкаНаПлатеж;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

		ВзаиморасчетыСервер.ЗаполнитьИдентификаторыСтрокВТабличнойЧасти(РасшифровкаПлатежа);
		ДенежныеСредстваСервер.ЗаполнитьОрганизациюВТабличнойЧасти(РасшифровкаПлатежа, Организация, ХозяйственнаяОперация);
	КонецЕсли;

	// Очистим реквизиты документа не используемые для хозяйственной операции.
	МассивВсехРеквизитов = Новый Массив;
	МассивРеквизитовОперации = Новый Массив;
	Документы.ПоступлениеБезналичныхДенежныхСредств.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
	ХозяйственнаяОперация,
	МассивВсехРеквизитов,
	МассивРеквизитовОперации);
	ДенежныеСредстваСервер.ОчиститьНеиспользуемыеРеквизиты(
	ЭтотОбъект,
	МассивВсехРеквизитов,
	МассивРеквизитовОперации);

	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьУчетПрочихАктивовПассивов") И НЕ ЗначениеЗаполнено(СтатьяАктивовПассивов) Тогда
		СтатьяАктивовПассивов = ПланыВидовХарактеристик.СтатьиАктивовПассивов.ПрочиеПассивы;
	КонецЕсли;

	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПогашениеЗаймаСотрудником Тогда
		Для Каждого Строка Из РасшифровкаПлатежа Цикл
			Строка.СтатьяДоходов = ПланыВидовХарактеристик.СтатьиАктивовПассивов.ЗаймыВыданные;
			Строка.АналитикаАктивовПассивов = Неопределено;
		КонецЦикла;
	КонецЕсли;

	Если ДенежныеСредстваСервер.ОперацияПоЗарплате(ХозяйственнаяОперация) Тогда

		Для Каждого Строка Из РасшифровкаПлатежа Цикл
			Строка.СтатьяДоходов = ПланыВидовХарактеристик.СтатьиАктивовПассивов.ОплатаТруда;
			Строка.АналитикаАктивовПассивов = Организация;
		КонецЦикла;


	КонецЕсли;

	Если Не ЗначениеЗаполнено(Номер) Тогда
		УстановитьНовыйНомер();
	КонецЕсли;

	Если ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежноеТребование
		И Не (ЗначениеЗаполнено(НомерВходящегодокумента) Или ЗначениеЗаполнено(ДатаВходящегоДокумента)) Тогда
		НомерВходящегодокумента = СокрЛП(ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Номер, Истина, Истина));
		ДатаВходящегоДокумента = Дата;
	КонецЕсли;

	ФорматированноеНазначениеПлатежа = ДенежныеСредстваСервер.ФорматироватьНазначениеПлатежа(НазначениеПлатежа);

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОшибкиЗагрузки = "";
	КонецЕсли;

	ДоходыИРасходыСервер.ИнициализироватьПустоеЗначениеСтатьиВТЧ(РасшифровкаПлатежа, "СтатьяДоходов");

	ДенежныеСредстваСервер.ЗаполнитьШапкуПоДаннымРасшифровки(ЭтотОбъект);

	ПоступлениеБезналичныхДенежныхСредствЛокализация.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);

КонецПроцедуры //-- #Б-960 смарт: Мосолов 23.09.2024 

//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
&ИзменениеИКонтроль("ПриКопировании")
Процедура смарт_ПриКопировании(ОбъектКопирования)

	ДатаВходящегоДокумента = "";
	НомерВходящегоДокумента = "";
	ДатаПроведенияБанком = "";
	ДатаВыгрузки = "";
	ДатаЗагрузки = "";
	ОшибкиЗагрузки = "";
	ФорматированноеНазначениеПлатежа = "";
	ДанныеВыписки = "";
	ИмяКонтрагента = "";

	Если ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ИнкассовоеПоручение
		Или ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежныйОрдер Тогда
		ПроведеноБанком = Истина;
		ДатаПроведенияБанком = ТекущаяДатаСеанса();
	Иначе
		ПроведеноБанком = Ложь;
	КонецЕсли;

	Для Каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
		Если ТипЗнч(СтрокаРасшифровки.Заказ) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Тогда
			СтрокаРасшифровки.Заказ = Неопределено;
		КонецЕсли;
	КонецЦикла;

	Ответственный = Пользователи.ТекущийПользователь();

	ПоступлениеБезналичныхДенежныхСредствЛокализация.ПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
	#Вставка
	//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
	//++#1320 смарт: Лопато 01.03.2023 //Изменить порядок вычисленя Курса и Суммы взаиморасчета в валюте  
	смартРасчетОтКурса = Ложь;
	//--#1320 смарт: Лопато 01.03.2023
	//-- #Б-960 смарт: Мосолов 23.09.2024
	#КонецВставки
	
КонецПроцедуры //-- #Б-960 смарт: Мосолов 23.09.2024

//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура смарт_ОбработкаПроведения(Отказ, РежимПроведения)
	
	#Вставка
	//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 24.09.2020 №405 проверка документа на проведение, если Истина, тогда сначала отменяем проведение
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение и ЭтотОбъект.Проведен тогда
		// Инициализация дополнительных свойств для проведения документа
		ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		//Влючение режима отмены проведения
		ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
		
		// Подготовка наборов записей
		ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		СформироватьСписокРегистровДляКонтроля();
		
		// Запись наборов записей
		ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
		
		РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(ЭтотОбъект, Отказ);
		РегистрыСведений.СостоянияЗаказовПоставщикам.ОтразитьСостояниеЗаказа(ЭтотОбъект, Отказ);
		ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);
		
		ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
	КонецЕсли;
	ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение;
	//Смарт }Подкин Алексей Иванович 24.09.2020 15:14:17
	
	//-- #Б-960 смарт: Мосолов 23.09.2024 
	#КонецВставки
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

	// Инициализация данных документа
	Документы.ПоступлениеБезналичныхДенежныхСредств.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);

	// Подготовка наборов записей
	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	// Движения по денежным средствам.
	ДенежныеСредстваСервер.ОтразитьДенежныеСредстваБезналичные(ДополнительныеСвойства, Движения, Отказ);
	ДенежныеСредстваСервер.ОтразитьДенежныеСредстваВПути(ДополнительныеСвойства, Движения, Отказ);
	ДенежныеСредстваСервер.ОтразитьДенежныеСредстваКВыплате(ДополнительныеСвойства, Движения, Отказ);
	ДенежныеСредстваСервер.ОтразитьДенежныеСредстваУПодотчетныхЛиц(ДополнительныеСвойства, Движения, Отказ);
	ДенежныеСредстваСервер.ОтразитьЛимитыРасходаДенежныхСредств(ДополнительныеСвойства, Движения, Отказ);

	// Движения по расчетам с поставщиками и клиентами.
	ВзаиморасчетыСервер.ОтразитьРасчетыСКлиентами(ДополнительныеСвойства, Движения, Отказ);
	ВзаиморасчетыСервер.ОтразитьРасчетыСПоставщиками(ДополнительныеСвойства, Движения, Отказ);

	// Движения по прочим доходам.
	ДоходыИРасходыСервер.ОтразитьПрочиеДоходы(ДополнительныеСвойства, Движения, Отказ);
	ДоходыИРасходыСервер.ОтразитьПрочиеРасходы(ДополнительныеСвойства, Движения, Отказ);
	ДоходыИРасходыСервер.ОтразитьПрочиеАктивыПассивы(ДополнительныеСвойства, Движения, Отказ);

	// Движения по расчетам по договорам кредитов (депозитов)
	ДенежныеСредстваСервер.ОтразитьРасчетыПоФинансовымИнструментам(ДополнительныеСвойства, Движения, Отказ);


	ВзаиморасчетыСервер.ОтразитьСуммыДокументаВВалютеРегл(ДополнительныеСвойства, Движения, Отказ);

	// Движения по оборотным регистрам управленческого учета
	УправленческийУчетПроведениеСервер.ОтразитьДвиженияДенежныхСредств(ДополнительныеСвойства, Движения, Отказ);
	УправленческийУчетПроведениеСервер.ОтразитьДвиженияДенежныеСредстваКонтрагент(ДополнительныеСвойства, Движения, Отказ);
	УправленческийУчетПроведениеСервер.ОтразитьДвиженияДенежныеСредстваДоходыРасходы(ДополнительныеСвойства, Движения, Отказ);
	УправленческийУчетПроведениеСервер.ОтразитьДвиженияКонтрагентКонтрагент(ДополнительныеСвойства, Движения, Отказ);


	СформироватьСписокРегистровДляКонтроля();

	// Запись наборов записей
	ПоступлениеБезналичныхДенежныхСредствЛокализация.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	РегистрыСведений.СостоянияЗаказовПоставщикам.ОтразитьСостояниеЗаказа(ЭтотОбъект, Отказ);
	ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);

	РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(ЭтотОбъект, Отказ);
	РегистрыСведений.РеестрДокументов.ЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);

	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
	#Вставка
	//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
	
	//++ смарт:Подкин #1128 п2 16.09.2022 10:14:05 позже, оформить фоновым заданием
    Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение 
        И НЕ ОбменДанными.Загрузка 
        И НЕ Отказ Тогда 
        
        Если Справочники.смартПредопределенныеЗначения.ПроцентОплатыЗаказаДляИерархииПоОплате.Значение = Неопределено Тогда
            ПределПроцента = 0;
        Иначе
            ПределПроцента = Справочники.смартПредопределенныеЗначения.ПроцентОплатыЗаказаДляИерархииПоОплате.Значение;
        КонецЕсли; 
        
        Если РасшифровкаПлатежа.Количество() И ПроведеноБанком Тогда
            Для каждого Стр Из РасшифровкаПлатежа Цикл
                //Добавляем запись в регистр смартОплатыПоЗаказам по Заказам клиента(ЗК) в Документах Поступления БДС.
                //ЗК - не в статусе Закрыт, не помечен на Удаление, Проведен
                Отбор = Новый Структура;
                Отбор.Вставить("Заказ", Стр.Заказ);
                ПроцентОплаты = 0;
                ВыборкаРег = РегистрыСведений.СостоянияЗаказовКлиентов.Выбрать(Отбор);
                
                Если ВыборкаРег.Следующий() Тогда
                    ПроцентОплаты = ВыборкаРег.ПроцентОплаты;
                КонецЕсли;
                
                Если ТипЗнч(Стр.Заказ) = Тип("ДокументСсылка.ЗаказКлиента") 
                    И Стр.Заказ.Проведен И НЕ Стр.Заказ.ПометкаУдаления 
                    И НЕ Стр.Заказ.Статус = Перечисления.СостоянияЗаказовКлиентов.Закрыт 
                    И ПроцентОплаты >= ПределПроцента Тогда
                    НаборЗаписей = РегистрыСведений.смартОплатыПоЗаказам.СоздатьНаборЗаписей(); 
                    НаборЗаписей.Отбор.ЗаказКлиента.Установить(Стр.Заказ); 
                    НоваяЗапись = НаборЗаписей.Добавить(); 
                    НоваяЗапись.ЗаказКлиента = Стр.Заказ; 
                    НоваяЗапись.ПоступлениеБДС = Ссылка; 
                    НаборЗаписей.Записать(); 
				КонецЕсли;  
				
				//++ #1349 смарт: Фролов 03.05.2023 //Добавить оповещение при оплате 30% при поступлении оплаты. Продолжение задачи 1134
				Если ТипЗнч(Стр.Заказ) = Тип("ДокументСсылка.ЗаказКлиента") 
                    И Стр.Заказ.Проведен И НЕ Стр.Заказ.ПометкаУдаления 
                    И НЕ Стр.Заказ.Статус = Перечисления.СостоянияЗаказовКлиентов.Закрыт Тогда
					смартСервер.ОтправитьПисьмоПоОплатеЗаказа(Стр.Заказ);
				Конецесли;	
				//-- #1349 смарт: Фролов 03.05.2023 
				
            КонецЦикла;
        КонецЕсли;
    КонецЕсли;  
	//-- смарт:Подкин #1128 п2 16.09.2022 10:14:05
	
	//-- #Б-960 смарт: Мосолов 23.09.2024
	#КонецВставки
	
КонецПроцедуры //-- #Б-960 смарт: Мосолов 23.09.2024

//++ #7488 смарт: Тимофеева 29.07.2026 / Загрузка выписки клиент-банка, фильтр загруженных документов
&ИзменениеИКонтроль("ПриЗаписи")
Процедура смарт_ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не Отказ И Не ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		РегистрыСведений.РеестрДокументов.ИнициализироватьИЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);
	КонецЕсли;

	ПоступлениеБезналичныхДенежныхСредствЛокализация.ПриЗаписи(ЭтотОбъект, Отказ);
	#Вставка
	//++ #7488 смарт: Тимофеева 29.07.2026 / Загрузка выписки клиент-банка, фильтр загруженных документов
	СвойствоНомераЗаказовКлиентов = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул", "НомераЗаказовКлиентов");
	Если ЗначениеЗаполнено(СвойствоНомераЗаказовКлиентов) Тогда
		МенеджерЗаписи = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
				
		МенеджерЗаписи.Объект = Ссылка;
		МенеджерЗаписи.Свойство = СвойствоНомераЗаказовКлиентов;
		МенеджерЗаписи.Значение = СформироватьНомераЗаказовКлиентов(РасшифровкаПлатежа);
		МенеджерЗаписи.Записать();
	КонецЕсли;
	//-- #7488 смарт: Тимофеева 29.07.2026 
	#КонецВставки

КонецПроцедуры  

Функция СформироватьНомераЗаказовКлиентов(ТаблицаРасшифровкаПлатежа)
	МассивНомеров = Новый Массив;
	Для Каждого СтрокаРасшифровки Из ТаблицаРасшифровкаПлатежа Цикл
		Если ЗначениеЗаполнено(СтрокаРасшифровки.ОснованиеПлатежа)
			И ТипЗнч(СтрокаРасшифровки.ОснованиеПлатежа) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			НомерЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРасшифровки.ОснованиеПлатежа, "Номер");
            МассивНомеров.Добавить(ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерЗаказа, Истина, Истина));
		КонецЕсли;
	КонецЦикла;
	Возврат СтрСоединить(МассивНомеров, ", ");
КонецФункции
//-- #7488 смарт: Тимофеева 29.07.2026 

#КонецОбласти
